toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
SDStatusResp System::_sd_sendCmd(
    uint8_t sdCmd,
    uint32_t sdArg,
    SDSendCmdMsg::RespType respType,
    SDSendCmdMsg::DatInType datInType
) {
    
    _ice_transfer(SDSendCmdMsg(sdCmd, sdArg, respType, datInType));
    
    // Wait for command to be sent
    const uint16_t MaxAttempts = 1000;
    for (uint16_t i=0; i<MaxAttempts; i++) {
        if (i >= 10) HAL_Delay(1);
        auto status = _sd_status();
        // Try again if the command hasn't been sent yet
        if (!status.cmdDone()) continue;
        // Try again if we expect a response but it hasn't been received yet
        if ((respType==SDRespType::Len48||respType==SDRespType::Len136) && !status.respDone()) continue;
        // Try again if we expect DatIn but it hasn't been received yet
        if (datInType==SDDatInType::Len512x1 && !status.datInDone()) continue;
        return status;
    }
    // Timeout sending SD command
    abort();
}

void System::_sd_readTask() {
    static bool reading = false;
    const auto& arg = _cmd.arg.SDRead;
    TaskBegin();
    
    // Accept command
    _usb.cmdAccept(true);
    
    // Stop reading from the SD card if a read is in progress
    if (reading) {
        _ICE_ST_SPI_CS_::Write(1);
        
        // ====================
        // CMD12 | STOP_TRANSMISSION
        //   State: Send Data -> Transfer
        //   Finish reading
        // ====================
        {
            auto status = _sd_sendCmd(SDSendCmdMsg::CMD12, 0);
            Assert(!status.respCRCErr());
        }
        
        reading = false;
    }
    
    // Reset DataIn endpoint (which sends a 2xZLP+sentinel sequence)
    _usb.reset(Endpoints::DataIn);
    // Wait until we're done resetting the DataIn endpoint
    TaskWait(_usb.ready(Endpoints::DataIn));
    
    // Update state
    reading = true;
    
    // ====================
    // CMD18 | READ_MULTIPLE_BLOCK
    //   State: Transfer -> Send Data
    //   Read blocks of data (1 block == 512 bytes)
    // ====================
    {
        auto status = _sd_sendCmd(SDSendCmdMsg::CMD18, arg.addr, SDRespType::Len48, SDDatInType::Len4096xN);
        Assert(!status.respCRCErr());
    }
    
    // Start the Readout task
    _readoutTask.reset();
}

#pragma mark - Img

ICE40::ImgI2CStatusResp System::_imgI2CStatus() {
    ImgI2CStatusResp resp;
    return _ice_transfer(ImgI2CStatusMsg(), resp);
}

ICE40::ImgCaptureStatusResp System::_imgCaptureStatus() {
    ImgCaptureStatusResp resp;
    return _ice_transfer(ImgCaptureStatusMsg(), resp);
}

ImgI2CStatusResp System::_imgI2C(bool write, uint16_t addr, uint16_t val) {
    _ice_transfer(ImgI2CTransactionMsg(write, 2, addr, 0));
    
    // Wait for the I2C transaction to complete
    const uint32_t MaxAttempts = 1000;
    for (uint32_t i=0; i<MaxAttempts; i++) {
        if (i >= 10) HAL_Delay(1);
        const ImgI2CStatusResp status = _imgI2CStatus();
        if (status.err() || status.done()) return status;
    }
    // Timeout getting response from ICE40
    // This should never happen, since it indicates a Verilog error or a hardware failure.
    abort();
}

ImgI2CStatusResp System::_imgI2CRead(uint16_t addr) {
    return _imgI2C(false, addr, 0);
}

ImgI2CStatusResp System::_imgI2CWrite(uint16_t addr, uint16_t val) {
    return _imgI2C(true, addr, val);
}

void _img_reset() {
    _usb.cmdAccept(true);
    
    _ice_transfer(ImgResetMsg(0));
    HAL_Delay(1);
    _ice_transfer(ImgResetMsg(1));
    // Wait 150k EXTCLK (16MHz) periods
    // (150e3*(1/16e6)) == 9.375ms
    HAL_Delay(10);
}

void System::_img_i2cTask() {
    static ImgI2CStatus imgStatus = {};
    const auto& arg = _cmd.arg.ImgI2C;
    TaskBegin();
    _usb.cmdAccept(true);
    
    {
        const ImgI2CStatusResp status = _imgI2C(arg.write, arg.addr, arg.val);
        imgStatus.ok = !status.err();
        imgStatus.readData = status.readData();
    }
    
    {
        _usb.send(Endpoints::DataIn, &imgStatus, sizeof(imgStatus));
        TaskWait(_usb.ready(Endpoints::DataIn));
    }
}

void System::_img_captureTask() {
    static ImgCaptureStatus imgStatus = {};
    TaskBegin();
    _usb.cmdAccept(true);
    
    _ice_transfer(ImgCaptureMsg(0));
    
    // Wait a max of `MaxDelayMs` for the the capture to be ready for readout
    constexpr uint32_t MaxDelayMs = 1000;
    const uint32_t startTime = HAL_GetTick();
    ICE40::ImgCaptureStatusResp status;
    for (;;) {
        status = _imgCaptureStatus();
        if (status.done() || (HAL_GetTick()-startTime)>=MaxDelayMs) break;
    }
    
    imgStatus.ok                = status.done();
    imgStatus.wordCount         = status.wordCount();
    imgStatus.highlightCount    = status.highlightCount();
    imgStatus.shadowCount       = status.shadowCount();
    
    _usb.send(Endpoints::DataIn, &imgStatus, sizeof(imgStatus));
    TaskWait(_usb.ready(Endpoints::DataIn));
    
    // Bail if the capture failed
    if (!imgStatus.ok) return;
    
    // Start the Readout task
    _readoutTask.reset();
}

#pragma mark - Other Commands

void System::_ledSet() {
    switch (_cmd.arg.LEDSet.idx) {
    case 0: _usb.cmdAccept(false); return;
    case 1: _LED1::Write(_cmd.arg.LEDSet.on); break;
    case 2: _LED2::Write(_cmd.arg.LEDSet.on); break;
    case 3: _LED3::Write(_cmd.arg.LEDSet.on); break;
    }
    
    _usb.cmdAccept(true);
}

System Sys;

bool IRQState::SetInterruptsEnabled(bool en) {
    const bool prevEn = !__get_PRIMASK();
    if (en) __enable_irq();
    else __disable_irq();
    return prevEn;
}

void IRQState::WaitForInterrupt() {
    __WFI();
}

int main() {
    Sys.init();
    Sys.run();
    return 0;
}

[[noreturn]] void abort() {
    Sys.abort();
}
